renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA4C1BD.h
        struct
        {
            __IOM uint8_t LOCOUTRM : 8; /*!< [7..0] LOCO User Trimming 1000_0000 : -128 1000_0001 : -127
                                         *   1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center
                                         *   Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 :
                                         +126 0111_1111 : +127These bits are added to original LOCO
                                         *   trimming bits                                                             */
        } LOCOUTCR_b;
    };
    __IM uint8_t  RESERVED67;
    __IM uint32_t RESERVED68[11];

    union
    {
        __IOM uint8_t VBTLVDCR;        /*!< (@ 0x000004C0) EXLVDVBAT Circuit Control Register                         */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVDVBAT Pin Low Voltage Detect Enable                            */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] EXLVDVBAT Pin Low Voltage Detect Level Select                      */
        } VBTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDSR;        /*!< (@ 0x000004C1) EXLVDVBAT Circuit Status Register                          */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVDVBAT Pin Low Voltage Detect Flag                              */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVDVBAT Pin Low Voltage Monitor Flag                             */
            uint8_t           : 2;
        } VBTLVDSR_b;
    };

    union
    {
        __IOM uint8_t VBTCMPCR;        /*!< (@ 0x000004C2) EXLVDVBAT Comparator Control Register                      */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Circuit Output Enable             */
            uint8_t            : 7;
        } VBTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDICR;       /*!< (@ 0x000004C3) EXLVDVBAT Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Interrupt Enable                  */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVDVBAT Pin Low Voltage Detect Interrupt Generation
                                        *   Condition Select                                                          */
            uint8_t : 2;
        } VBTLVDICR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDCR;        /*!< (@ 0x000004C4) LVDVRTC Circuit Control Register                           */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] VRTC Pin Low Voltage Detect Enable                                 */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] VRTC Pin Low Voltage Detect Level Select                           */
        } VRTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VRTSR;           /*!< (@ 0x000004C5) VRTC Status Register                                       */

        struct
        {
            __IOM uint8_t PORDET : 1;  /*!< [0..0] VRTC-domain Power-on Reset Detect Flag                             */
            __IOM uint8_t DET    : 1;  /*!< [1..1] VRTC Voltage Variation Detection Flag                              */
            uint8_t              : 2;
            __IM uint8_t VRTVLD  : 1;  /*!< [4..4] VRTC-domain Valid                                                  */
            __IM uint8_t MON     : 1;  /*!< [5..5] VRTC Signal Monitor Flag                                           */
            uint8_t              : 2;
        } VRTSR_b;
    };

    union
    {
        __IOM uint8_t VRTCMPCR;        /*!< (@ 0x000004C6) VRTC Comparator Control Register                           */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] VRTC Pin Low Voltage Detect Circuit Output Enable                  */
            uint8_t            : 7;
        } VRTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDICR;       /*!< (@ 0x000004C7) VRTC Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] VRTC Pin Low Voltage Detect Interrupt Enable                       */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] VRTC Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } VRTLVDICR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCR;         /*!< (@ 0x000004C8) EXLVD Circuit Control Register                             */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVD Pin Low Voltage Detect Enable                                */
            uint8_t            : 3;
        } EXLVDCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDSR;         /*!< (@ 0x000004C9) EXLVD Circuit Status Register                              */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVD pin Low Voltage Detect Flag                                  */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVD pin Low Voltage Monitor Flag                                 */
            uint8_t           : 2;
        } EXLVDSR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCMPCR;      /*!< (@ 0x000004CA) EXLVD Comparator Control Register                          */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVD Pin Low Voltage Detect Circuit Output Enable                 */
            uint8_t            : 7;
        } EXLVDCMPCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDICR;        /*!< (@ 0x000004CB) EXLVD Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVD Pin Low Voltage Detect Interrupt Enable                      */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVD Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } EXLVDICR_b;
    };
} R_SYSTEM_Type;                       /*!< Size = 1228 (0x4cc)                                                       */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN)
 */

